app/controllers/members/requests_controller.rb

SELECT * FROM "requests"
---
    completed_pending_requests = PendingRequest.find(:all, :conditions => {:caregiver_requestor_id => current_user.id, :confirmed => "true"})
    for completed_pending_request in completed_pending_requests
      current_request = Request.find_by_id(completed_pending_request.request_id)
      end_time = Time.local(current_request.to_date.year, current_request.to_date.month, current_request.to_date.day, current_request.end_time.hour, current_request.end_time.min)