app/controllers/households_controller.rb

  def index
    @households = Household.all
---
SELECT * FROM "households"

  def show
    @household = Household.find(params[:id])
---
SELECT * FROM "households" WHERE ("households"."id" = 1)

  def create
    @household = Household.new(params[:household])
    if @household.save
---
INSERT INTO "households" ("name", "created_at", "updated_at", "credits") VALUES('McKenna', '2011-05-24 20:27:42', '2011-05-24 20:27:42', 24)