app/controllers/requests_controller.rb

SELECT * FROM "requests"
---
  def index
    @requests = Request.all

SELECT * FROM "requests" WHERE ("requests"."id" = 1)
---
  def show
    @request = Request.find(params[:id])

INSERT INTO "requests" ("end_time", "created_at", "cost", "updated_at", "date", "start_time") VALUES('2011-05-26 17:28:00', '2011-05-25 15:29:09', 2.0, '2011-05-25 15:29:09', '2011-05-26 15:28:00', '2011-05-26 15:28:00')
---
  def create
    @request = Request.new(params[:request])
    if @request.save