app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT * FROM "roles"

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM "roles" WHERE ("roles"."id" = 1)

  def create
    @role = Role.new(params[:role])
    if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at", "users_count", "description") VALUES('Administrator', '2011-05-24 20:27:57', '2011-05-24 20:27:57', 0, 'Admin')