app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "role_id", "password_salt", "persistence_token", "phone", "last_name", "email", "first_name") VALUES('2011-05-24 19:00:51', 'aee71df86ad87361d43dbc9915d5eae7093b117ec121755156840df6b26346e01ab5e9a5ba33b4bc19ec6045bb62c1b9d93a5fd385c8c74cd63cfd0cfd35b3d9', '2011-05-24 19:00:51', 'cmckenna', NULL, 'I3jzIM80Ba9qWoM20rJ', '1d5e18939313df7d397c739c737242bbee35db8ea2315ff23c186b747379df5dee244be9b62a2dd1772012cd76087ca0cf4351a58ac06ed3237d5c0c95021726', NULL, NULL, 'cmckenna@mines.edu', NULL)