app/controllers/user_sessions_controller.rb

SELECT * FROM "users" WHERE (LOWER("users".username) = 'cmck') LIMIT 1
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      flash[:success] = "Login successful."
      redirect_to home_url_for(UserSession.find.user)